Repository: StellarHermitUa/vacancy-scraper-ua
Catalog: languages/vacancy-scraper-ua-*.po
Languages: ru_ru, uk

source: Receives job vacancies from work.ua and robota.ua for display on the website
ru_ru: Получает вакансии с work.ua и robota.ua для отображения на сайте
uk: Отримує вакансії з work.ua та robota.ua для відображення на вебсайті

source: Security check failed.
ru_ru: Проверка безопасности не пройдена.
uk: Перевірка безпеки не пройдена.

source: Company data removed.
ru_ru: Данные компании удалены.
uk: Дані компанії видалено.

source: Company ID saved successfully.
ru_ru: ID компании успешно сохранён.
uk: ID компанії успішно збережено.

source: Vacancies copied
ru_ru: Вакансии скопированы
uk: Вакансії скопійовано

source: Vacancies fetching will be implemented soon.
ru_ru: Получение вакансий будет реализовано в ближайшее время.
uk: Отримання вакансій буде реалізовано найближчим часом.

source: Options saved.
ru_ru: Настройки сохранены.
uk: Налаштування збережено.

source: Template not found.
ru_ru: Шаблон не найден.
uk: Шаблон не знайдено.

source: Help
ru_ru: Помощь
uk: Допомога

source: Are you sure you want to delete the company? All data will be deleted.
ru_ru: Вы уверены, что хотите удалить компанию? Все данные будут удалены.
uk: Ви впевнені, що хочете видалити компанію? Усі дані буде видалено.

source: Do you want to fetch vacancies now? Existing vacancies will be rewritten.
ru_ru: Хотите получить вакансии сейчас? Существующие вакансии будут перезаписаны.
uk: Бажаєте отримати вакансії зараз? Існуючі вакансії буде перезаписано.

source: The Work.ua company ID or URL cannot be empty.
ru_ru: ID или URL компании Work.ua не может быть пустым.
uk: ID або URL компанії Work.ua не може бути порожнім.

source: Could not extract company ID from the Work.ua URL.
ru_ru: Не удалось извлечь ID компании из URL Work.ua.
uk: Не вдалося витягти ID компанії з URL Work.ua.

source: The URL must be from work.ua.
ru_ru: URL должен быть с сайта work.ua.
uk: URL має бути з сайту work.ua.

source: The Work.ua company ID must be numeric.
ru_ru: ID компании Work.ua должен быть числовым.
uk: ID компанії Work.ua має бути числовим.

source: No vacancies found or invalid Work.ua company ID.
ru_ru: Вакансий не найдено или недействительный ID компании Work.ua.
uk: Вакансій не знайдено або недійсний ID компанії Work.ua.

source: The Rabota.ua company ID or URL cannot be empty.
ru_ru: ID или URL компании Robota.ua не может быть пустым.
uk: ID або URL компанії Robota.ua не може бути порожнім.

source: Could not extract company ID from the Rabota.ua URL.
ru_ru: Не удалось извлечь ID компании из URL Robota.ua.
uk: Не вдалося витягти ID компанії з URL Robota.ua.

source: The URL must be from robota.ua.
ru_ru: URL должен быть с сайта robota.ua.
uk: URL має бути з сайту robota.ua.

source: The Rabota.ua company ID must be numeric.
ru_ru: ID компании Robota.ua должен быть числовым.
uk: ID компанії Robota.ua має бути числовим.

source: Data output for work.ua
ru_ru: Вывод данных для work.ua
uk: Вивід даних для work.ua

source: Shortcode usage
ru_ru: Использование шорткода
uk: Використання шорткоду

source: To display vacancies from Work.ua, use the following shortcode on any page or post:
ru_ru: Чтобы отобразить вакансии с Work.ua, используйте следующий шорткод на любой странице или в записи:
uk: Щоб відобразити вакансії з Work.ua, використовуйте наступний шорткод на будь-якій сторінці або у дописі:

source: The output will be based on the options selected in the plugin settings page (Work.ua tab).
ru_ru: Вывод будет основан на параметрах, выбранных на странице настроек плагина (вкладка Work.ua).
uk: Вивід базуватиметься на опціях, вибраних на сторінці налаштувань плагіна (вкладка Work.ua).

source: Using in template code
ru_ru: Использование в коде шаблона
uk: Використання в коді шаблону

source: To embed the list of vacancies from Work.ua directly into your theme template files, use the following function:
ru_ru: Чтобы встроить список вакансий с Work.ua прямо в файлы шаблона вашей темы, используйте следующую функцию:
uk: Щоб вставити список вакансій з Work.ua безпосередньо у шаблон вашої теми, використовуйте наступну функцію:

source: Getting raw data
ru_ru: Получение сырых данных
uk: Отримання сирих даних

source: If you want to get raw vacancy data for custom processing, use the following function:
ru_ru: Если вы хотите получить сырые данные вакансий для собственной обработки, используйте следующую функцию:
uk: Якщо ви хочете отримати сирі дані вакансій для власної обробки, використовуйте наступну функцію:

source: The returned array includes two main sections: "options" (settings used for output) and "jobs" (list of vacancies).
ru_ru: Возвращаемый массив включает два основных раздела: "options" (настройки вывода) и "jobs" (список вакансий).
uk: Повернений масив містить два основні розділи: "options" (налаштування для виводу) та "jobs" (список вакансій).

source: Data output for robota.ua
ru_ru: Вывод данных для robota.ua
uk: Вивід даних для robota.ua

source: To display vacancies from Robota.ua, use the following shortcode:
ru_ru: Чтобы отобразить вакансии с Robota.ua, используйте следующий шорткод:
uk: Щоб відобразити вакансії з Robota.ua, використовуйте наступний шорткод:

source: The output will be based on the options selected in the plugin settings page (Robota.ua tab)
ru_ru: Вывод основан на параметрах, выбранных на странице настроек плагина (вкладка Robota.ua)
uk: Вивід базуватиметься на опціях, вибраних на сторінці налаштувань плагіна (вкладка Robota.ua)

source: To embed the list of vacancies from Robota.ua directly into your theme template files, use the following function:
ru_ru: Чтобы встроить список вакансий с Robota.ua прямо в файлы шаблона вашей темы, используйте следующую функцию:
uk: Щоб вставити список вакансій з Robota.ua безпосередньо у шаблон вашої теми, використовуйте наступну функцію:

source: For full access to the raw data from Robota.ua, use:
ru_ru: Для полного доступа к сырым данным с Robota.ua используйте:
uk: Для повного доступу до сирих даних з Robota.ua використовуйте:

source: Vacancy Scraper UA – Settings
ru_ru: Vacancy Scraper UA – Настройки
uk: Vacancy Scraper UA – Налаштування

source: Enter Robota.ua company ID(123456) or URL(https://robota.ua/company123456) and click Save.
ru_ru: Введите ID компании Robota.ua (123456) или URL (https://robota.ua/company123456) и нажмите Сохранить.
uk: Введіть ID компанії Robota.ua (123456) або URL (https://robota.ua/company123456) і натисніть Зберегти.

source: Save
ru_ru: Сохранить
uk: Зберегти

source: Company added:
ru_ru: Добавлена компания:
uk: Додано компанію:

source: Delete
ru_ru: Удалить
uk: Видалити

source: Fetch Vacancies
ru_ru: Получить вакансии
uk: Отримати вакансії

source: Additional Options
ru_ru: Дополнительные настройки
uk: Додаткові налаштування

source: Filter by city
ru_ru: Фильтр по городу
uk: Фільтр за містом

source: On/Off
ru_ru: Вкл./Выкл
uk: Увімк./Вимк

source: Job Vacancies Colors
ru_ru: Цвета вакансий
uk: Кольори вакансій

source: Background Color
ru_ru: Цвет фона
uk: Колір фону

source: Title Color
ru_ru: Цвет заголовка
uk: Колір заголовка

source: City Color
ru_ru: Цвет города
uk: Колір міста

source: Salary Color
ru_ru: Цвет зарплаты
uk: Колір зарплати

source: Button Color
ru_ru: Цвет кнопки
uk: Колір кнопки

source: Save Options
ru_ru: Сохранить настройки
uk: Зберегти налаштування

source: Vacancies List
ru_ru: Список вакансий
uk: Список вакансій

source: Name
ru_ru: Имя
uk: Ім’я

source: City
ru_ru: Город
uk: Місто

source: Salary
ru_ru: Зарплата
uk: Зарплата

source: Link
ru_ru: Ссылка
uk: Посилання

source: View Vacancy
ru_ru: Просмотреть вакансию
uk: Переглянути вакансію

source: « Previous
ru_ru: « Назад
uk: « Назад

source: Next »
ru_ru: Дальше »
uk: Далі »

source: No vacancies found.
ru_ru: Вакансий не найдено.
uk: Вакансій не знайдено.

source: Enter Work.ua company ID(123456) or URL(https://www.work.ua/jobs/by-company/123456/) and click Save.
ru_ru: Введите ID компании Work.ua (123456) или URL (https://www.work.ua/jobs/by-company/123456/) и нажмите Сохранить.
uk: Введіть ID компанії Work.ua (123456) або URL (https://www.work.ua/jobs/by-company/123456/) і натисніть Зберегти.

source: All cities
ru_ru: Все города
uk: Всі міста
